HELP_1 = """✅**<u>⚡اوامر التشغيل⚡:</u>**

✅اوامرالتشغيل :

🎺 | - اوامر تشغيل البوت في الجروبات والقنوات  •
🎺 | - الاوامر تعمل بدون استخدام اي علامات  •
▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬
◍ - اوامر تشغيل البوت في المجموعات - √

◍ -『 تشغيل 』
 ثم اسم المقطع الصوتي او الرابط الخاص به  •
◍ -『 فيديو 』
 ثم اسم مقطع الفيديو او الرابط الخاص به  •
◍ -『 تنزيل 』
 ثم اسم المقطع المراد تنزيله من موقع اليوتيوب مباشر او الرابط الخاص به  •
◍ -『 ريلود 』
 قم بأرسالها ( دآخل المجموعات ) لتحديث قائمه المشرفين بمجموعتك  •
▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬
◍ - جزء القنوات - √
◍ - اوامر تشغيل البوت في القنوات 👇 - √

◍ -『 تشغيل 』
 ثم اسم المقطع الصوتي او الرابط الخاص به لتشغيله بقناتك  •
◍ -『 فيديو 』
ثم اسم الفيديو او الرابط الخاص به لتشغيله بقناتك  •
▬࣪࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬."""

HELP_2 = """⚡ **<u>⚡اوامر المشرفين⚡ :</u>**

✅اوامر الادمن:

▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬
🎧 | - إليك اوامر التحكم بالمقاطع المشغله ( دآخل المجموعات )  •
🔻 | - الاوامر تعمل بدون استخدام اي علامات  •
▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬

◍ -『 وقف 』
 لإيقاف المقطع مؤقتآ داخل المحادثه الصوتيه  •
◍ -『 كمل 』
 لاستئناف المقطع مره اخري داخل المحادثه الصوتيه  •
◍ -『 اسكت 』
 لكتم صوت المقطع داخل المحادثه الصوتيه  •
◍ -『 اتكلم 』
 لألغاء كتم صوت المقطع داخل المحادثه الصوتيه  •
◍ -『 تخطي 』
 للتخطي إلي المقطع المنتظر بقائمة الانتظار لديك  •
◍ -『 ايقاف 』
 لأنهاء التشغيل ومغادره المساعد المحادثه الصوتيه  •
▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬
🎙️ | - إليك اوامر التحكم بالمقاطع المشغله ( دآخل القنوات )  •
🔻 | - الاوامر تعمل بدون استخدام اي علامات  •
▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬

◍ -『 وقف 』
 لإيقاف المقطع مؤقتآ داخل المحادثه الصوتيه  •
◍ -『 كمل 』
 لاستئناف المقطع مره اخري داخل المحادثه الصوتيه  •
◍ -『 اسكت 』
 لكتم صوت المقطع داخل المحادثه الصوتيه  •
◍ -『 اتكلم 』
 لألغاء كتم صوت المقطع داخل المحادثه الصوتيه  •
◍ -『 تخطي 』
 للتخطي إلي المقطع المنتظر بقائمة الانتظار لديك  •
◍ -『 ايقاف 』
 لأنهاء التشغيل ومغادره المساعد المحادثه الصوتيه  •
▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬."""

HELP_3 = """🍒 **<u>⚡اوامر اضافية⚡</u>** 

أوامر إضافية:
 /start - ابدأ تشغيل بوت الميوزك
 /help - الحصول على قائمة مساعد الأوامر مع شرح مفصل للأوامر.
 /ping- التحقق من سرعة  عمل البوت

 ✅ إعدادات المجموعة:
 / الإعدادات - احصل على إعدادات المجموعة الكاملة باستخدام الأزرار المضمنة

 🔗 خيارات في الإعدادات:

 1️⃣ يمكنك ضبط جودة الصوت التي تريد دفقها على الدردشة الصوتية.

 2️⃣ يمكنك ضبط جودة الفيديو التي تريد دفقها على الدردشة الصوتية.

 3️⃣ مستخدمو المصادقة: - يمكنك تغيير وضع أوامر المسؤول من هنا للجميع أو للمسؤولين فقط.  إذا كان الجميع ، أي شخص موجود في مجموعتك سيكون قادرًا على استخدام أوامر المسؤول (مثل / تخطي ، / إيقاف ، إلخ)

 4️⃣ الوضع النظيف: عند التمكين ، يحذف رسائل الروبوت بعد 5 دقائق من مجموعتك للتأكد من بقاء محادثتك نظيفة وجيدة.

 5️⃣ Command Clean: عند التنشيط ، سيحذف Bot أوامره المنفذة (/play ، /pause ، /shuffle ، /stop وما إلى ذلك) على الفور.

 6️⃣ إعدادات اللعب:

 /playmode - احصل على لوحة إعدادات تشغيل كاملة مع أزرار حيث يمكنك ضبط إعدادات تشغيل مجموعتك.

 خيارات في وضع التشغيل:

 1 ، وضع البحث [مباشر أو داخلي] - يغير وضع البحث أثناء منحك / وضع التشغيل.

 2️⃣ أوامر المسؤول [الكل أو المسؤولون] - إذا كان الجميع ، أي شخص موجود في مجموعتك سيكون قادرًا على استخدام أوامر المسؤول (مثل / تخطي ، / إيقاف ، إلخ)

 3 نوع التشغيل [الكل أو المسؤولون] - إذا كانوا مدراء ، يمكن فقط للمسؤولين الموجودين في المجموعة تشغيل الموسيقى على الدردشة الصوتية."""

HELP_4 = """🛠 **<u>⚡اوامر اخرى⚡:</u>**

✅اوامر البوت:

▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬
✅ | - إليك قسم ( الاوامر الاضافيه ) للبوت  •
✅ | - جميع الاوامر تعمل بدون علامات  •
▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬

◍ -『 حدد 』
 ثم رقم المجموعات الذي تستخدم بوتك فيديو بنفس الوقت •

◍ -『 وضع شغل 』
 لضبط وضع تحكم التشغيل للأدمن او للاعضاء داخل مجموعتك  •

◍ -『 القائمه 』
 لعرض قائمه التشغيل الخاصه بك  •

◍ -『 حذف القائمه 』
 لحذف قائمه التشغيل الخاصه بك  •

◍ -『 لغه 』
 لتغيير لغة البوت إلي اي لغه اخري  •

◍ -『 احصائيات 』
 لعرض قسم الاحصائيات العامه للبوت ولترند التشغيل العالمي •

◍ -『 ريلود 』
 لتحديث قائمة المشرفين داخل مجموعتك •

◍ -『 بينج 』
 لقياس سرعه التشغيل علي السيرفر وعرض تفاصيل معلومات التشغيل •

◍ -『 كلمات 』
 ثم اسم الاغنيه لجلب كلمات الاغنيه كامله بصيغه النصوص •

◍ -『 تنزيل 』
 ثم اسم المقطع او الرابط الخاص به لتحميله مباشر من اليوتيوب •
▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬"""

HELP_5 = """👨‍💻 **<u>⚡اوامر المطور⚡:</u>**

🔰 إضافة وإزالة مطورين البوت:
 /addudo [اسم المستخدم أو الرد على مستخدم]
 /delsudo [اسم المستخدم أو الرد على مستخدم]

 🛃HEROKU:
 / الاستخدام - Dyno Usage.

 🌐CONFIG VARS:
 /get_var - احصل على var config من Heroku أو .env.
 /del_var - احذف أي var على Heroku أو .env.
 /set_var [Var Name] [القيمة] - قم بتعيين Var أو تحديث Var على heroku أو .env.  منفصلة Var وقيمتها مع مسافة.

 أوامر BOT:
 /reboot - أعد تشغيل الروبوت الخاص بك.
 /تحديث - تحديث البوت.
 /speedtest - تحقق من سرعات الخادم
 /maintenance  [تمكين / تعطيل]
 /logger [تمكين / تعطيل] - يقوم البوت بتسجيل الاستعلامات التي تم البحث عنها في مجموعة المسجل.
 /get_log [Number of Lines] - احصل على سجل للروبوت الخاص بك من heroku أو vps.  يعمل لكليهما.
 /autoend [تمكين | تعطيل] - تمكين إنهاء البث التلقائي بعد 3 دقائق إذا لم يكن هناك من يستمع.

 أوامر الحالة:
 /activevoice - تحقق من الدردشات الصوتية النشطة على الروبوت.
 /activevideo - تحقق من مكالمات الفيديو النشطة على الروبوت.
 /stats - تحقق من إحصائيات الروبوتات

 ⚠️ وظيفة الدردشة في القائمة السوداء:
 /blacklistchat [CHAT_ID] - ضع أي دردشة في القائمة السوداء من استخدام بوت الميوزك
 /whitelistchat [CHAT_ID] - أضف أي دردشة بالقائمة السوداء إلى القائمة البيضاء من استخدام Music Bot
 /blacklistedchat - تحقق من جميع الدردشات المدرجة في القائمة السوداء.

 👤 وظيفة محظورة:
 /block [اسم المستخدم أو الرد على مستخدم] - يمنع المستخدم من استخدام أوامر الروبوت.
 /unblok [اسم المستخدم أو الرد على مستخدم] - إزالة مستخدم من قائمة بوت المحظورة.
 /blockusers - تحقق من قوائم المستخدمين المحظورة

 وظيفة 👤GBAN:
 /gban [اسم المستخدم أو الرد على مستخدم] - Gban مستخدمًا من الدردشة التي يقدمها الروبوت وأوقفه عن استخدام برنامج الروبوت الخاص بك.
 /ungban [اسم المستخدم أو الرد على مستخدم] - أزل مستخدمًا من قائمة gbanned في Bot واسمح له باستخدام برنامج الروبوت الخاص بك
 /gbannedusers - تحقق من قوائم المستخدمين Gbanned

 وظيفة مكالمات الفيديو:
 /set_video_limit [عدد الدردشات] - قم بتعيين الحد الأقصى لعدد الدردشات المسموح بها لمكالمات الفيديو في كل مرة.  افتراضي إلى 3 محادثات.
 /videomode [تنزيل | m3u8] - إذا تم تمكين وضع التنزيل ، فسيقوم الروبوت بتنزيل مقاطع الفيديو بدلاً من تشغيلها في شكل M3u8.  افتراضيا إلى M3u8.  يمكنك استخدام وضع التنزيل عندما لا يتم تشغيل أي استعلام في وضع m3u8.

 ⚡️ وظيفة BOT الخاصة:
 /authorize [CHAT_ID] - اسمح بالمحادثة لاستخدام الروبوت الخاص بك.
 /unauthorize [CHAT_ID] - امنع الدردشة من استخدام الروبوت الخاص بك.
 /authorized - تحقق من جميع الدردشات المسموح بها في برنامج الروبوت الخاص بك.

 🌐 وظيفة البث:
 /broadcast [رسالة أو رد على رسالة] - بث أي رسالة إلى الدردشات التي يقدمها الروبوت.

 خيارات البث:
 -pin: سيؤدي هذا إلى تثبيت رسالتك
 -pinloud: سيؤدي هذا إلى تثبيت رسالتك بإشعار عالٍ
 -user: سيؤدي هذا إلى بث رسالتك للمستخدمين الذين بدأوا برنامج الروبوت الخاص بك.
 -assistant: سيؤدي هذا إلى بث رسالتك من حساب المساعد في الروبوت الخاص بك.
 -nobot: سيؤدي هذا إلى إجبار الروبوت الخاص بك على عدم بث الرسالة
 /broadcast -user -assistant -pin Hello Testing"""
